{
  "where is the team based?": {
    "answer": "Our team is distributed across the U.S., Singapore, Vietnam, and Thailand — a true Web3-native setup. More detailed team information will be shared soon. Stay tuned by following our updates.",
    "link": null
  },
  "where can i find fundraising information?": {
    "answer": "Our $2.1M pre-seed round was recently announced. You can read more in this article: The Block - ARO Network Raises $2.1M",
    "link": null
  },
  "are tokenomics available?": {
    "answer": "Tokenomics will be announced later — stay tuned! However, 5% of the total token supply is allocated for all Jade distributions to the community before TGE.",
    "link": null
  },
  "can one ip support multiple nodes?": {
    "answer": "Yes, one IP can support multiple nodes. Just make sure your upload speed can handle it. Rewards depend on bandwidth and performance. An ARO Pod supports up to 100 Mbps, and you can run more if your network allows.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "why hasn’t my aro lite node earned anything after running for an hour?": {
    "answer": "Rewards are calculated hourly. If your network is stable, you should start seeing rewards within 1–2 hours. If your network frequently disconnects or changes IP, rewards may be delayed.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "why am i online, but my node shows low rewards?": {
    "answer": "At this stage, we're only using a small fraction of your bandwidth to test network connectivity. Current rewards displayed are virtual and not final — they're for reference only.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "which port is the aro client listening to?": {
    "answer": "We’ll update documentation with this soon — please check back.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "my node doesn’t show up / says 'not added' — what should i do?": {
    "answer": "If you're using a mobile browser with extensions, it may not be supported. We’re working on support for this — stay tuned!",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "is there a tutorial for running the aro client node?": {
    "answer": "Yes! You can find the full guide here: ARO Docs – Software Setup",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "how can i add more nodes?": {
    "answer": "Node rewards depend on the bandwidth of each connection. If you can provide different networks (e.g., separate IPs or ISPs), you can deploy multiple nodes and bind them to your account. All active nodes will show up in your dashboard.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "does adding more nodes increase my jade and points?": {
    "answer": "During the Previewnet phase, ordering multiple ARO Pods under a single account will earn you more Jades. For running ARO Client or ARO Lite, tasks are only counted once per account per node type. For future phases like Testnet, rewards will scale with the bandwidth and quality of your contribution.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "open ports for different nodes?": {
    "answer": "The explanations of open ports for ARO Lite/ARO Pod and ARO Link/ARO Client have each been added as a corresponding FAQ at the end of their respective User Guides.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "why can't i connect to aro lite on my phone?": {
    "answer": "Please note that our ARO Lite is currently not fully optimized for mobile browsers. For the best experience, we recommend accessing it via desktop for now. Mobile compatibility updates will be notified to the community.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "how to install node in my mac/windows/linux?": {
    "answer": "ARO Client is a software image designed for X86 architectures, focused on Linux. You would need a virtual machine environment. Tutorial: https://docs.aro.network/user-guides/software-setup. Community reference: https://youtu.be/JDxlfBEEvIE",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "lite node disconnection": {
    "answer": "If you encounter connection issues with ARO Lite, remove the current plugin and reinstall version 0.0.4 (or latest). Or go to Browser → Extensions, find ARO Lite, toggle the switch off and on to reconnect.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "why is there so much difference between node lite and node pro?": {
    "answer": "Very limited impact on your internet experience for lite node. Pro nodes contribute significantly more resources and earn accordingly higher rewards.",
    "link": "https://docs.aro.network/user-guides/software-setup"
  },
  "what is the redeem code for, and when will i get one?": {
    "answer": "Redeem codes will be used in future campaigns and special events. They’ll be released soon!",
    "link": null
  },
  "is there a limit to how much jade you can earn per day?": {
    "answer": "There isn’t an exact number right now because it depends on your referrer and setup. Example: buying 10 pods or referring 1,000 people affects daily Jade earned.",
    "link": null
  },
  "after manually downloading the latest version 0.0.6 it produces a new serial number, what will happen to the old serial number that had accumulated jades?": {
    "answer": "The PreviewJade shown in any node is virtual and not actual mining rewards. Real mining will begin once Testnet starts. Old accumulated Jade still exists virtually.",
    "link": null
  },
  "how can i earn rewards for content contributions?": {
    "answer": "We’ll be launching various community activities and content creation contests soon — with Jade rewards. The first campaign may go live as early as next week.",
    "link": null
  },
  "i live in uzbekistan and wanted to order an aro device, but there is no delivery to this country. what should i do?": {
    "answer": "Sorry, some regions don’t have open channels to purchase ARO Pods. Start by running the ARO Client first.",
    "link": null
  },
  "about hiring": {
    "answer": "Hi, thanks for reaching out! At the moment, we're not actively hiring. We’ll consider future applicants from our community of Aronauts. Stay active in the community and watch for announcements.",
    "link": null
  },
  "paid influencers service": {
    "answer": "We are not actively looking for influencer partnerships. Currently running a campaign for KOLs: drive user sign-ups to be ranked. Top performer receives $10,000 reward + opportunity to join community round.",
    "link": "https://medium.com/aronetwork/aro-previewnet-referral-sprint-af3453526b37"
  },
  "listing": {
    "answer": "We haven’t had our TGE yet, but thank you for asking! Stay tuned for official announcements.",
    "link": null
  },
  "pre-order a aro pod and no confirmation": {
    "answer": "All users who place an order will receive a confirmation email. If payment was made but no email received, submit a ticket with email, payment screenshot, and transaction hash.",
    "link": null
  },
  "what is ARO Network?": {
    "answer": "ARO Network is a decentralized edge cloud built for the AI-First Internet. It lets anyone contribute idle bandwidth, compute, or storage to power a global distributed edge cloud that supports content delivery and AI workloads.",
    "link": "https://docs.aro.network/aro-network/aro-overview/"
  },
  "why was ARO Network created?": {
    "answer": "Because current centralized edge clouds are not prepared for the upcoming AI-First Internet: AI agents will dominate traffic and demand bidirectional data flows, inference at the edge, and high throughput and low latency. ARO was designed to meet those demands by decentralizing and distributing edge resources.",
    "link": "https://docs.aro.network/aro-network/aro-overview/"
  },
  "who can join ARO Network as a node operator?": {
    "answer": "Anyone with a stable internet connection and compatible hardware — home devices, servers, even idle bandwidth — can join as an Edge Node operator. Participation is permissionless.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "what types of ARO Nodes exist?": {
    "answer": "There are several node types: hardware (plug-and-play devices such as ARO Pod), software (ARO Client), and lightweight options like ARO Lite (browser extension). A WiFi-router based node called ARO Link is planned.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "do I need permission to join and run a node?": {
    "answer": "No. ARO Network is permissionless — you don’t need special approval or qualifications to participate.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "what does an Edge Node contribute to the network?": {
    "answer": "Edge Nodes contribute idle network bandwidth, compute power, and storage. They serve resources to end users close to them geographically, enabling faster content delivery and edge-based AI workloads.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "how are Edge Nodes verified and prevented from cheating?": {
    "answer": "Edge Nodes generate regular Work Reports per epoch. Their reports are cross-validated by multiple Keeper Nodes through mechanisms like heartbeats, traffic tracking, and random challenges — making it hard to forge or cheat the system.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "what is a Keeper Node?": {
    "answer": "Keeper Nodes act as validators and guardians of the network. They maintain consensus, validate workloads and work reports from Edge Nodes, perform random checks and challenges, and record global state on-chain.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "how does ARO’s blockchain fit into the system?": {
    "answer": "ARO uses an EVM-based blockchain as a public ledger to store global state: track workloads, compute and distribute rewards, manage payments & orders, and support on-chain governance.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "are ARO nodes region-specific?": {
    "answer": "Yes. Nodes — both Edge and Keeper — register a geo-region before joining. This ensures that edge resources are geographically close to end users, optimizing latency and service quality.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "how does the geographic segmentation affect network performance?": {
    "answer": "By localizing nodes, ARO ensures that data flows and content delivery happen close to end users, reducing latency and improving speed and reliability compared to distant centralized data centers.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "what happens if I join from a region with low demand?": {
    "answer": "Technically you can still join anywhere — but performance and potential rewards are higher if there’s demand in your region. Proximity to users matters for optimal results.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "how are contributions rewarded in ARO Network?": {
    "answer": "Resource providers (Edge Nodes) receive rewards for their contributions based on validated workloads. Rewards are distributed in the network’s native token.",
    "link": "https://docs.aro.network/edge-node/rewards"
  },
  "what is the native token of ARO Network?": {
    "answer": "The native token is $ARO. It serves as the fundamental medium of value exchange within the network.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "what can $ARO be used for?": {
    "answer": "$ARO can be used for payments (users paying for edge resources), staking & collateral for Keeper Nodes, rewarding resource providers and contributors, and participating in on-chain governance.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "does ARO have staking and network security mechanisms?": {
    "answer": "Yes. ARO uses a GPoS (Guaranteed Proof-of-Stake) consensus. Keeper Node operators (and possibly delegators) stake $ARO as collateral to secure the network. Slashing mechanisms discourage misbehavior.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "can $ARO holders participate in governance?": {
    "answer": "Yes. $ARO holders have governance rights — they can propose and vote on decisions impacting the protocol and ecosystem.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "is the $ARO tokenomics already defined?": {
    "answer": "Yes — the tokenomics are defined, detailing token utilities like payments, incentives, staking, and governance.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "what kinds of clients (users) can benefit from ARO’s edge cloud?": {
    "answer": "Enterprises, streaming platforms, e-commerce sites, gaming services, AI & IoT businesses — any service needing scalable, low-latency content delivery or edge-based compute.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "what is PCDN in ARO’s context?": {
    "answer": "PCDN stands for Peer-to-Peer Content Delivery Network. It’s one of ARO’s offerings — a decentralized CDN leveraging distributed edge nodes to deliver content closer to users.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "what is AiDN?": {
    "answer": "AiDN stands for AI Delivery Network — a decentralized infrastructure layer enabling deployment and execution of AI workloads at the edge, powered by distributed nodes.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "why would a business choose ARO over a traditional CDN or cloud provider?": {
    "answer": "Because ARO offers lower latency (thanks to geo-distributed nodes), cost-efficiency (uses idle bandwidth/hardware), scalability, and AI-ready infrastructure — potentially cheaper and faster than legacy centralized CDNs/data-centers.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "are 3rd-party developers supported on ARO now?": {
    "answer": "Not yet. While ARO’s architecture anticipates SDKs and APIs for third-party developers, these are still under development.",
    "link": "https://docs.aro.network/developer-guide/overview"
  },
  "what will 3rd-party developers be able to build on ARO Network?": {
    "answer": "Developers will be able to build things like P2P CDNs, edge-based AI applications (AI transformer components), content delivery platforms, and other services leveraging ARO’s distributed edge infrastructure.",
    "link": "https://docs.aro.network/developer-guide/overview"
  },
  "what’s the current stage of ARO (as of now)?": {
    "answer": "ARO is currently in the Testnet phase (after Previewnet), where the network is live for resource testing, onboarding nodes, and reward distribution under test settings.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "what were the earlier phases before Testnet?": {
    "answer": "The earlier phase was Previewnet — used to onboard early contributors and bootstrap the network before actual Testnet launch.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "what happens after Testnet?": {
    "answer": "Next step is Mainnet launch — when the real, production-grade decentralized edge cloud goes live, and $ARO tokens become the main utility token in the ecosystem.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "what is the reward system during Testnet?": {
    "answer": "During Testnet, contributors earn rewards in the form of ‘Jade’ points (for resource contributions) and ‘Badges’ (for community/contributor activities). Jade is convertible to $ARO at TGE (token generation event).",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "how is Jade computed during Testnet?": {
    "answer": "Jade is awarded based on each node’s validated workload: bandwidth, uptime, resource usage, etc. The system tracks node performance, then distributes a daily Jade emission pool across all participating nodes.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "are there different Jade pools for different node types?": {
    "answer": "Yes. For example, Edge Nodes (hardware or software) share one major Jade rewards pool; lightweight Checker Nodes like ARO Lite share a separate, smaller pool.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "can I claim my rewards and exit the network anytime?": {
    "answer": "Yes — the network allows you to exit at any time and claim your pending rewards.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "does running an ARO node interfere with my regular internet usage?": {
    "answer": "No. ARO uses idle bandwidth and resources, minimizing impact on your daily internet usage.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "is high internet bandwidth required to run a node effectively?": {
    "answer": "Higher bandwidth and a stable internet connection improve your rewards and performance, but ARO supports a range of node types — from lightweight to more robust — so even moderate connections may work.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "what is the difference between ARO Pod, ARO Client, and ARO Lite?": {
    "answer": "ARO Pod is a plug-and-play hardware device optimized for always-on operation; ARO Client is software you install on a server/PC for more flexible setups; ARO Lite is a lightweight browser extension requiring minimal setup and resources.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "is there a plan for a WiFi-router node option?": {
    "answer": "Yes — the planned ARO Link is a router with built-in ARO node functionality, intended for business or high-throughput use cases.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "how can I track/manage my node and rewards?": {
    "answer": "Through the ARO Dashboard — where you create an account, view/manage your nodes, track resource contribution, referral links, and claim rewards.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "is there a referral program?": {
    "answer": "Yes. During Testnet, you can refer friends; if they join and contribute, you may earn extra bonuses/commissions on Jade rewards.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "what are Badges in ARO Testnet?": {
    "answer": "Badges are non-transferable rewards for community or ecosystem contributions beyond node operation — such as referrals, community activities, content creation — rewarding broader participation.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "will Jade and Badges have value after Testnet?": {
    "answer": "Yes. Jade (and potentially Badges) are used to qualify for token allocation after the Testnet ends: for example, 5% of total $ARO token supply is reserved for pre-TGE contributors.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "does ARO aim to compete with existing CDNs/data centers?": {
    "answer": "Yes. By using decentralized edge resources and crypto-native incentive mechanisms, ARO aims to offer a scalable, cost-effective, and global alternative to traditional CDNs or centralized data centers.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "is prior infrastructure required to host a node (e.g. server rack)?": {
    "answer": "Not necessarily. ARO supports lightweight nodes using home devices or even a browser extension; no need for dedicated servers.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "how is fairness ensured when distributing rewards?": {
    "answer": "Through cross-validation by Keeper Nodes, randomized challenge protocols, and a transparent on-chain ledger tracking workloads — reducing potential for cheating or manipulation.",
    "link": "https://docs.aro.network/technologies/network/"
  },
  "if the network grows large, does ARO scale?": {
    "answer": "Yes — ARO is designed as a hyperscale decentralized edge cloud, aggregating resources from many participants to meet large demand for content delivery and AI workloads.",
    "link": "https://docs.aro.network/aro-network/aro-overview/"
  },
  "what are the next major milestones for ARO Network?": {
    "answer": "After Testnet, ARO plans a Mainnet launch, broader node expansion, support for enterprise customers, rollout of SDKs/APIs for developers, and open governance.",
    "link": "https://docs.aro.network/campaign-hub/aro-testnet/"
  },
  "can I contribute even with minimal hardware/internet (e.g. home PC)?": {
    "answer": "Yes — lighter options like ARO Lite (browser extension) or ARO Client on your PC make participation possible even without dedicated hardware.",
    "link": "https://docs.aro.network/user-guides/run-node/"
  },
  "what kinds of workloads can ARO support at the edge?": {
    "answer": "From simple content delivery (streaming, files) to AI workloads requiring compute and storage — e.g. real-time inference, AI models, data analytics near the user.",
    "link": "https://docs.aro.network/edge-cloud-guide/edge-cloud-solutions/"
  },
  "is there a public repository for ARO’s code or docs?": {
    "answer": "Yes — ARO’s public repositories (e.g. docs, website, explorer) are hosted publicly.",
    "link": "https://github.com/aro-network"
  },
  "what happens if I misbehave or node fails to meet requirements?": {
    "answer": "Misbehaving nodes or invalid work reports can be penalized (e.g. via slashing), and contributions may be rejected or rewards withheld, to maintain network integrity.",
    "link": "https://docs.aro.network/aro-tokenomics/tokenomics/"
  },
  "This Agent version is not supported / Outdated Agent version detected": {
    "answer": "The issue arises from an outdated version of the Agent software in your ARO Client. Ensure your node is connected to the internet and allow time for automatic updates. If the problem continues to exist, ask official channels for help.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Restricted Region Detected!": {
    "answer": "Your node is operating in a restricted region according to legal restrictions. This may result in the cancellation of your rewards. See Terms of Use for more details.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "PCDN Client program not found": {
    "answer": "You need to install a PCDN Worker client to run PCDN services on your ARO Client. Refer to PCDN Worker tutorials for instructions.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "ARO Client goes offline when Debian system auto‑sleeps": {
    "answer": "If your Debian system enters sleep mode, network connectivity suspends. Configure your power settings to prevent auto‑sleep for stable node operation.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Agent internal error": {
    "answer": "There is an internal error in the node agent. Provide your node's Serial Number and contact technical support or community channels.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Incorrect PCDN Worker Network Mode": {
    "answer": "PCDN Worker client is running in incorrect network mode. Follow PCDN Worker Tutorial - configure bridge and network interface settings correctly.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "PCDN Worker launch failed": {
    "answer": "Try restarting the ARO Client node and check if the error persists. If it does, contact technical support.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Management Port is not open": {
    "answer": "PCDN Worker requires port 8080 (management port) to be open and exposed. Enable port 8080 as per the PCDN Worker installation instructions.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Invalid CPU config for PCDN Worker": {
    "answer": "This error indicates invalid CPU config — usually because too many CPU cores are allocated to PCDN Worker VM while bandwidth is < 1 Gbps. Allocate less than 7 CPU cores, wait ~10 minutes and check again.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "PCDN Worker is not connected": {
    "answer": "The PCDN Worker client VM is not connected (even if ARO Client/host machine is connected). Likely misconfigured network interface; carefully follow the PCDN Worker network configuration tutorial.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "PCDN Worker is not activated": {
    "answer": "This error indicates that the PCDN Worker is not activated for edge‑cloud services. If your ARO Client is activated but this persists, try reinstalling the PCDN Worker or contact support.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Disk configuration is invalid": {
    "answer": "Disk configuration (system disk vs data disk separation) for the PCDN Worker is invalid. Update disk configuration according to the installation guide.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "Insufficient disk space for PCDN Worker": {
    "answer": "Error caused by allocating too little disk space. For nodes >1 Gbps bandwidth, you need at least 200 GB system disk and 1 TB data disk(s).",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  },
  "What network ports should be open?": {
    "answer": "Inbound: UDP all ports; TCP 80, 443, 9500–9700. Outbound: UDP 40001–40100; TCP 443, 30002, 40001–40100.",
    "link": "https://docs.aro.network/node-operator-guide/aro-client/aro-client-faq-troubleshooting"
  }
}
